## pandas

In [1]:
import pandas as pd

## Create series

In [2]:
data = [3,4,5,6,7,8]

In [4]:
pd.Series(data)

0    3
1    4
2    5
3    6
4    7
5    8
dtype: int64

In [5]:
pd.Series(data,index=['a','b','c','d','e','f'])

a    3
b    4
c    5
d    6
e    7
f    8
dtype: int64

In [6]:
a= {"a":10,"b":20,"c":30,"d":40}

In [8]:
pd.Series(a)

a    10
b    20
c    30
d    40
dtype: int64

## 2.create dataframe manually

### method1. From a dictionary of list

In [ ]:
data = {
    'name'






}

In [1]:
import pandas as pd

In [9]:
data=pd.read_csv("C:/Users/hi/Downloads/my_file (1).csv")

In [ ]:
data.head(10)

,Rank,Peak,All Time Peak,Actual gross,Adjusted gross (in 2022 dollars),Artist,Tour title,Year(s),Shows,Average gross,Ref.
0,1,1,2,"$780,000,000","$780,000,000",Taylor Swift,The Eras Tour †,2023–2024,56,"$13,928,571",[1]
1,2,1,7[2],"$579,800,000","$579,800,000",Beyoncé,Renaissance World Tour,2023,56,"$10,353,571",[3]
2,3,1[4],2[5],"$411,000,000","$560,622,615",Madonna,Sticky & Sweet Tour ‡[4][a],2008–2009,85,"$4,835,294",[6]
3,4,2[7],10[7],"$397,300,000","$454,751,555",Pink,Beautiful Trauma World Tour,2018–2019,156,"$2,546,795",[7]
4,5,2[4],NaN,"$345,675,146","$402,844,849",Taylor Swift,Reputation Stadium Tour,2018,53,"$6,522,173",[8]
5,6,2[4],10[9],"$305,158,363","$388,978,496",Madonna,The MDNA Tour,2012,88,"$3,467,709",[9]
6,7,2[10],NaN,"$280,000,000","$381,932,682",Celine Dion,Taking Chances World Tour,2008–2009,131,"$2,137,405",[11]
7,7,NaN,NaN,"$257,600,000","$257,600,000",Pink,Summer Carnival †,2023–2024,41,"$6,282,927",[12]
8,9,NaN,NaN,"$256,084,556","$312,258,401",Beyoncé,The Formation World Tour,2016,49,"$5,226,215",[13]
9,10,NaN,NaN,"$250,400,000","$309,141,878",Taylor Swift,The 1989 World Tour,2015,85,"$2,945,882",[14]

In [17]:
data.tail(10)

,Rank,Peak,All Time Peak,Actual gross,Adjusted gross (in 2022 dollars),Artist,Tour title,Year(s),Shows,Average gross,Ref.
10,11,NaN,NaN,"$229,100,000[b]","$283,202,896",Beyoncé,The Mrs. Carter Show World Tour,2013–2014,132,"$1,735,606",[15][16]
11,12,NaN,14[17],"$227,400,000","$295,301,479",Lady Gaga,The Monster Ball Tour *,2009–2011,203,"$1,118,227",[18]
12,13,NaN,NaN,"$204,000,000","$251,856,802",Katy Perry,Prismatic World Tour,2014–2015,151,"$1,350,993",[19]
13,14,1[20],NaN,"$200,000,000","$299,676,265",Cher,Living Proof: The Farewell Tour ‡[21][a],2002–2005,325,"$615,385",[20]
14,15,2[c],NaN,"$194,000,000","$281,617,035",Madonna,Confessions Tour,2006,60,"$3,233,333",[5]
15,16,NaN,NaN,"$184,000,000","$227,452,347",Pink,The Truth About Love Tour,2013–2014,142,"$1,295,775",[22]
16,17,NaN,NaN,"$170,000,000","$213,568,571",Lady Gaga,Born This Way Ball,2012–2013,98,"$1,734,694",[d]
17,18,NaN,NaN,"$169,800,000","$207,046,755",Madonna,Rebel Heart Tour,2015–2016,82,"$2,070,732",[4]
18,19,NaN,NaN,"$167,700,000[e]","$204,486,106",Adele,Adele Live 2016,2016–2017,121,"$1,385,950",[25]
19,20,NaN,NaN,"$150,000,000","$185,423,109",Taylor Swift,The Red Tour,2013–2014,86,"$1,744,186",[26]

In [11]:
data.shape

(20, 11)

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 11 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Rank                              20 non-null     int64
 1   Peak                              9 non-null      object
 2   All Time Peak                     6 non-null      object
 3   Actual gross                      20 non-null     object
 4   Adjusted gross (in 2022 dollars)  20 non-null     object
 5   Artist                            20 non-null     object
 6   Tour title                        20 non-null     object
 7   Year(s)                           20 non-null     object
 8   Shows                             20 non-null     int64
 9   Average gross                     20 non-null     object
 10  Ref.                              20 non-null     object
dtypes: int64(2), object(9)
memory usage: 1.8+ KB

In [22]:
data.isnull().sum()

Rank                                 0
Peak                                11
All Time Peak                       14
Actual gross                         0
Adjusted gross (in 2022 dollars)     0
Artist                               0
Tour title                           0
Year(s)                              0
Shows                                0
Average gross                        0
Ref.                                 0
dtype: int64

In [15]:
data.describe()

            Rank       Shows
count  20.000000   20.000000
mean   10.450000  110.000000
std     5.942488   66.507617
min     1.000000   41.000000
25%     5.750000   59.000000
50%    10.500000   87.000000
75%    15.250000  134.500000
max    20.000000  325.000000

In [16]:
data.describe(include="all")

,Rank,Peak,All Time Peak,Actual gross,Adjusted gross (in 2022 dollars),Artist,Tour title,Year(s),Shows,Average gross,Ref.
count,20.000000,9,6,20,20,20,20,20,20.000000,20,20
unique,NaN,7,6,20,20,9,20,16,NaN,20,20
top,NaN,1,2,"$780,000,000","$780,000,000",Taylor Swift,The Eras Tour †,2013–2014,NaN,"$13,928,571",[1]
freq,NaN,2,1,1,1,4,1,3,NaN,1,1
mean,10.450000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,110.000000,NaN,NaN
std,5.942488,NaN,NaN,NaN,NaN,NaN,NaN,NaN,66.507617,NaN,NaN
min,1.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,41.000000,NaN,NaN
25%,5.750000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,59.000000,NaN,NaN
50%,10.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,87.000000,NaN,NaN
75%,15.250000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,134.500000,NaN,NaN
max,20.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,325.000000,NaN,NaN

In [19]:
data['Rank'].duplicated().sum()

np.int64(1)

In [23]:
data['Rank'].nunique()

19

In [24]:
data["Average gross"].describe()

count              20
unique             20
top       $13,928,571
freq                1
Name: Average gross, dtype: object

In [25]:
data['Average gross']

0     $13,928,571
1     $10,353,571
2      $4,835,294
3      $2,546,795
4      $6,522,173
5      $3,467,709
6      $2,137,405
7      $6,282,927
8      $5,226,215
9      $2,945,882
10     $1,735,606
11     $1,118,227
12     $1,350,993
13       $615,385
14     $3,233,333
15     $1,295,775
16     $1,734,694
17     $2,070,732
18     $1,385,950
19     $1,744,186
Name: Average gross, dtype: object

In [26]:
data['Average gross'][5]

'$3,467,709'

In [30]:
data.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
dtype: bool

In [28]:
data.duplicated().sum()

np.int64(0)

In [29]:
data['Rank'].duplicated().sum()

np.int64(1)

In [32]:
list(data.columns)

['Rank',
 'Peak',
 'All Time Peak',
 'Actual\xa0gross',
 'Adjusted\xa0gross (in 2022 dollars)',
 'Artist',
 'Tour title',
 'Year(s)',
 'Shows',
 'Average gross',
 'Ref.']

In [33]:
data1=['Ref.','Tour title']

In [35]:
data.drop(columns=data1)

,Rank,Peak,All Time Peak,Actual gross,Adjusted gross (in 2022 dollars),Artist,Year(s),Shows,Average gross
0,1,1,2,"$780,000,000","$780,000,000",Taylor Swift,2023–2024,56,"$13,928,571"
1,2,1,7[2],"$579,800,000","$579,800,000",Beyoncé,2023,56,"$10,353,571"
2,3,1[4],2[5],"$411,000,000","$560,622,615",Madonna,2008–2009,85,"$4,835,294"
3,4,2[7],10[7],"$397,300,000","$454,751,555",Pink,2018–2019,156,"$2,546,795"
4,5,2[4],NaN,"$345,675,146","$402,844,849",Taylor Swift,2018,53,"$6,522,173"
5,6,2[4],10[9],"$305,158,363","$388,978,496",Madonna,2012,88,"$3,467,709"
6,7,2[10],NaN,"$280,000,000","$381,932,682",Celine Dion,2008–2009,131,"$2,137,405"
7,7,NaN,NaN,"$257,600,000","$257,600,000",Pink,2023–2024,41,"$6,282,927"
8,9,NaN,NaN,"$256,084,556","$312,258,401",Beyoncé,2016,49,"$5,226,215"
9,10,NaN,NaN,"$250,400,000","$309,141,878",Taylor Swift,2015,85,"$2,945,882"
10,11,NaN,NaN,"$229,100,000[b]","$283,202,896",Beyoncé,2013–2014,132,"$1,735,606"
11,12,NaN,14[17],"$227,400,000","$295,301,479",Lady Gaga,2009–2011,203,"$1,118,227"
12,13,NaN,NaN,"$204,000,000","$251,856,802",Katy Perry,2014–2015,151,"$1,350,993"
13,14,1[20],NaN,"$200,000,000","$299,676,265",Cher,2002–2005,325,"$615,385"
14,15,2[c],NaN,"$194,000,000","$281,617,035",Madonna,2006,60,"$3,233,333"
15,16,NaN,NaN,"$184,000,000","$227,452,347",Pink,2013–2014,142,"$1,295,775"
16,17,NaN,NaN,"$170,000,000","$213,568,571",Lady Gaga,2012–2013,98,"$1,734,694"
17,18,NaN,NaN,"$169,800,000","$207,046,755",Madonna,2015–2016,82,"$2,070,732"
18,19,NaN,NaN,"$167,700,000[e]","$204,486,106",Adele,2016–2017,121,"$1,385,950"
19,20,NaN,NaN,"$150,000,000","$185,423,109",Taylor Swift,2013–2014,86,"$1,744,186"

In [34]:
data.drop(columns='Ref.')

,Rank,Peak,All Time Peak,Actual gross,Adjusted gross (in 2022 dollars),Artist,Tour title,Year(s),Shows,Average gross
0,1,1,2,"$780,000,000","$780,000,000",Taylor Swift,The Eras Tour †,2023–2024,56,"$13,928,571"
1,2,1,7[2],"$579,800,000","$579,800,000",Beyoncé,Renaissance World Tour,2023,56,"$10,353,571"
2,3,1[4],2[5],"$411,000,000","$560,622,615",Madonna,Sticky & Sweet Tour ‡[4][a],2008–2009,85,"$4,835,294"
3,4,2[7],10[7],"$397,300,000","$454,751,555",Pink,Beautiful Trauma World Tour,2018–2019,156,"$2,546,795"
4,5,2[4],NaN,"$345,675,146","$402,844,849",Taylor Swift,Reputation Stadium Tour,2018,53,"$6,522,173"
5,6,2[4],10[9],"$305,158,363","$388,978,496",Madonna,The MDNA Tour,2012,88,"$3,467,709"
6,7,2[10],NaN,"$280,000,000","$381,932,682",Celine Dion,Taking Chances World Tour,2008–2009,131,"$2,137,405"
7,7,NaN,NaN,"$257,600,000","$257,600,000",Pink,Summer Carnival †,2023–2024,41,"$6,282,927"
8,9,NaN,NaN,"$256,084,556","$312,258,401",Beyoncé,The Formation World Tour,2016,49,"$5,226,215"
9,10,NaN,NaN,"$250,400,000","$309,141,878",Taylor Swift,The 1989 World Tour,2015,85,"$2,945,882"
10,11,NaN,NaN,"$229,100,000[b]","$283,202,896",Beyoncé,The Mrs. Carter Show World Tour,2013–2014,132,"$1,735,606"
11,12,NaN,14[17],"$227,400,000","$295,301,479",Lady Gaga,The Monster Ball Tour *,2009–2011,203,"$1,118,227"
12,13,NaN,NaN,"$204,000,000","$251,856,802",Katy Perry,Prismatic World Tour,2014–2015,151,"$1,350,993"
13,14,1[20],NaN,"$200,000,000","$299,676,265",Cher,Living Proof: The Farewell Tour ‡[21][a],2002–2005,325,"$615,385"
14,15,2[c],NaN,"$194,000,000","$281,617,035",Madonna,Confessions Tour,2006,60,"$3,233,333"
15,16,NaN,NaN,"$184,000,000","$227,452,347",Pink,The Truth About Love Tour,2013–2014,142,"$1,295,775"
16,17,NaN,NaN,"$170,000,000","$213,568,571",Lady Gaga,Born This Way Ball,2012–2013,98,"$1,734,694"
17,18,NaN,NaN,"$169,800,000","$207,046,755",Madonna,Rebel Heart Tour,2015–2016,82,"$2,070,732"
18,19,NaN,NaN,"$167,700,000[e]","$204,486,106",Adele,Adele Live 2016,2016–2017,121,"$1,385,950"
19,20,NaN,NaN,"$150,000,000","$185,423,109",Taylor Swift,The Red Tour,2013–2014,86,"$1,744,186"

In [47]:
data['Peak'][4]='hi'

C:\Users\hi\AppData\Local\Temp\ipykernel_7192\3115959680.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  data['Peak'][4]='hi'
C:\Users\hi\AppData\Local\Temp\ipykernel_7192\3115959680.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['Peak'][4]='hi'

In [24]:
data3={
    'name':['ankit','sachin','sourav'],
    'age':[24,25,32],
    'profession':['sde','data','training']
}

In [25]:
df=pd.DataFrame(data3)
print(df)

     name  age profession
0   ankit   24        sde
1  sachin   25       data
2  sourav   32   training

In [27]:
df.loc[1]

name          sachin
age               25
profession      data
Name: 1, dtype: object

In [28]:
df.loc[[0,2],['name','age']]

     name  age
0   ankit   24
2  sourav   32

In [29]:
df.loc[df['age']>24,['name','profession']]

     name profession
1  sachin       data
2  sourav   training

In [31]:
df.loc[0]

name          ankit
age              24
profession      sde
Name: 0, dtype: object

In [32]:
df

     name  age profession
0   ankit   24        sde
1  sachin   25       data
2  sourav   32   training

In [33]:
df.iloc[0]

name          ankit
age              24
profession      sde
Name: 0, dtype: object

In [34]:
df.iloc[[0,1],[0,1]]

     name  age
0   ankit   24
1  sachin   25

In [36]:
df.loc[0,'name']
df.iloc[0,0]

'ankit'